#Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
print("Введите координату X:")
x = int(input())
print("Введите координату Y:")
y = int(input())
if x == 0 and y == 0:
    print('Точка начала координат. Введите другие значения')
elif x > 0 and y > 0:
    print("X = ", x, "Y = ", y, "--> 1-ая четверть")
elif x > 0 and y < 0:
    print("X = ", x, "Y = ", y, "--> 4-ая четверть")
elif x < 0 and y > 0:
    print("X = ", x, "Y = ", y, "--> 2-ая четверть")
elif x < 0 and y < 0:
    print("X = ", x, "Y = ", y, "--> 3-ая четверть")
elif x == 0 and y < 0 or y > 0:
    print("X = ", x, "Y = ", y, "--> координата на оси ординат ОY")
elif y == 0 and x < 0 or x > 0:
    print("X = ", x, "Y = ", y, "--> координата на оси абсцисс ОX")